Library like numpy but we can put different types of data in different columns
We can also use column heading and row numbers or labels as well

It is more optimized to handle large datasets of different types and is internally based on numpy

we can use numpy features in pandas as well
Pandas is needed to handle multi dimensional data, organize it and filter it, and fill missing data and remove extra data

In [ ]:
we use data handling to manage data and handle large data

To create data pipeline and process it properly to perform prediction 
or clustering or other operations properly

Pandas is used for machine learning or deep learning or other scenarios
To review,analyze or plot about data

Our basic data requirement is based on multi dimensional data and
this data is based on different types of data

to handle multidimensional data, we use pandas as a tool

In [ ]:
We pandas for processes related to machine learning like
Collecting and Storing data
Filtering Sampling
Filling and removing duplicates
Merging and Spliting

In [ ]:
Data processing Time Line for Large Data Handling
Collecting
Filling Missing
Removing uncessary data
Adding new data
Data Spliting
feeding to ML

In [ ]:
sentimental analysis :: to see through the data and obtain the users review
        
we store and organize the data in pandas
we'll use columns to store this data from the website
with beautiful soap or scrappy tool

In [ ]:
we can perform a regression analysis with pandas by processing 
data and predict future conditions

we can give a heading for each column and give labels to each row

In [ ]:
data can be anything text numerical or unstructured data

different types of data::::
            textual data(review, comment, etc)
            numerical data(rates, years, force, etc)
            pictures(rows, columns, color, etc)
            videos
            time series(temperature timelapse)
            other patterns(symbols, signals, etc)

## With Pandas we can preprocess organize manage and filter data

python numpy library is differentiated from pandas because of the associated index with the array

In [3]:
import pandas as pd
obj = pd.Series([4,7,-5,3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

### Series has Value paired with Index

In [5]:
sales = pd.Series([100,200,100,400])
#we can specify to print only values
print(sales.values)
#we can specify to print only index
print(sales.index)

[100 200 100 400]
RangeIndex(start=0, stop=4, step=1)

In [7]:
#we can also specify intended indexes
sales1 = pd.Series([100,200,100,400], index = ['a', 'b', 'c', 'd'])
print(sales1)

a    100
b    200
c    100
d    400
dtype: int64

In [13]:
#we can also specify intended indexes
sales1 = pd.Series([100,200,100,400], index = ['Jan', 'Feb', 'Mar', 'Apr'])
print(sales1)

print("\n",sales1.values)
# pandas gives data type to be object if it finds a non-integer data
print("\n",sales1.index)

Jan    100
Feb    200
Mar    100
Apr    400
dtype: int64

 [100 200 100 400]

 Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')

In [17]:
#we can also specify intended name for the series which ould be later used as the column header

sales1 = pd.Series([100,200,100,400], 
                   index = ['Jan', 'Feb', 'Mar', 'Apr'], 
                   name = "4 month sales")
print(sales1)

Jan    100
Feb    200
Mar    100
Apr    400
Name: 4 month sales, dtype: int64

In [19]:
import pandas as pd
canteen_data = pd.Series([200,300,400,500,600,700,800],
                        index = ['Mon','Tue','Wed','Thu','Fri','Sat','Sun'],
                        name = "Canteen Sales")
print(canteen_data)

Mon    200
Tue    300
Wed    400
Thu    500
Fri    600
Sat    700
Sun    800
Name: Canteen Sales, dtype: int64

### accessing data

In [25]:
#through indexes number
print(canteen_data[1])

#through indexes string
print("x--------------x")
print(canteen_data["Tue"])

300
x--------------x
300

In [28]:
# to access multiple values with extra square bracket i.e array notation
print(canteen_data[[3,5]])

Thu    500
Sat    700
Name: Canteen Sales, dtype: int64

In [30]:
#conditional selection
print(canteen_data[canteen_data > 400])

Thu    500
Fri    600
Sat    700
Sun    800
Name: Canteen Sales, dtype: int64

In [31]:
# array can be mathematically operated
canteen_data * 2

Mon     400
Tue     600
Wed     800
Thu    1000
Fri    1200
Sat    1400
Sun    1600
Name: Canteen Sales, dtype: int64

In [34]:
# to find an index in the series
"Mon" in canteen_data

True

In [40]:
# To make a series from numpy array or list
import numpy as np
a = np.array([3,2,4,5,6])
b = ['a','b','c','d','e']

obj = pd.Series(a, index = b)

print(obj)

a    3
b    2
c    4
d    5
e    6
dtype: int32

In [46]:
# data can also be taken from dictionary
data = {"Sindh": 3500, "Punjab":4500, "KPK": 3000, "Balochistan":2000}
tax_by_state = pd.Series(data)
print(tax_by_state)

print("\n",tax_by_state.values)
print(tax_by_state.index)

Sindh          3500
Punjab         4500
KPK            3000
Balochistan    2000
dtype: int64

 [3500 4500 3000 2000]
Index(['Sindh', 'Punjab', 'KPK', 'Balochistan'], dtype='object')

In [48]:
# index positions can also be changed, values will also be shuffled
data = {"Sindh": 3500, "Punjab":4500, "KPK": 3000,
        "Balochistan":2000}
tax_by_state = pd.Series(data, index = ["Punjab","Sindh","KPK","Balochistan"])
print(tax_by_state)

Punjab         4500
Sindh          3500
KPK            3000
Balochistan    2000
dtype: int64

In [53]:
# to identify null value in series
data = {"Sindh": 3500, "Punjab":4500, "KPK": 3000,
        "Balochistan":2000}
tax_by_state = pd.Series(data, index = ["Punjab","Sindh","KPK",
                                        "Balochistan", "GB"])
print(tax_by_state)

# Nan means that value doesnt exist in the series
print("\nx-------------------------------------x")
print(pd.isnull(tax_by_state))

Punjab         4500.0
Sindh          3500.0
KPK            3000.0
Balochistan    2000.0
GB                NaN
dtype: float64

x-------------------------------------x
Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

### two ways to check null values in series

In [54]:
pd.isnull(tax_by_state) # Function

tax_by_state.isnull()  # Method

Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

In [56]:
#Individual names for index and values

tax_by_state.name = "state tax paying capacity"
tax_by_state.index.name = "states name"


print(tax_by_state)
print("")
print(tax_by_state.index)

states name
Punjab         4500.0
Sindh          3500.0
KPK            3000.0
Balochistan    2000.0
GB                NaN
Name: state tax paying capacity, dtype: float64

Index(['Punjab', 'Sindh', 'KPK', 'Balochistan', 'GB'], dtype='object', name='states name')

#### Series are a part of dataframe and these names are used in dataframe

* The data to be stored in series has to be single dimension

# DataFrame

* dataframe is used for more than one dimensions data in series
* with multiple columns with index
* multiple columns can be stored with named and index can also be given
* indexes can be numeric or alphabetic labels
* two series can be merged to make a dataframe

* whenever two series are joined, if index is not same, data is not properly merged and kept seperately

In [62]:
import pandas as pd

apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,2,0,1])

#print(apples, oranges)

# to merge them, make a dictionary to use keys as column names
data = {"apples": apples, "oranges":oranges}

# making dataframe
fruits_df = pd.DataFrame(data)
print(fruits_df)

   apples  oranges
0       3        3
1       2        2
2       0        0
3       1        1

In [83]:
data1 = {
    'state' : ['Ohio','Ohio', 'Ohio','Nevada','Nevada','Nevada'],
    'year': [2000,2001,2002,2001,2002,2003],
    'pop': [1.5,1.7,3.6,2.4,2.9,3.2],
}

# index has to be given according to the number of values
state_pop_df = pd.DataFrame(data1, index = ['1st','2nd','3rd',
                                    '4th', '5th', '6th'])
print(state_pop_df)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [84]:
# to print only top 5 values in case of bigdata
state_pop_df.head()

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9

In [85]:
# to print only bottom 5 values in case of bigdata
state_pop_df.tail()

      state  year  pop
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [86]:
# to give column names and change position
state_pop_df = pd.DataFrame(data1, columns = ['year','state','pop'])
state_pop_df

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [98]:
frame = pd.DataFrame(data1, columns = ['year','state',
                                              'pop', 'debt'], index = ['1st','2nd','3rd',
                                    '4th', '5th', '6th'])

# if column values are not available NaN is shown
# it can be filled later
frame.head()

     year   state  pop debt
1st  2000    Ohio  1.5  NaN
2nd  2001    Ohio  1.7  NaN
3rd  2002    Ohio  3.6  NaN
4th  2001  Nevada  2.4  NaN
5th  2002  Nevada  2.9  NaN

In [99]:
# to see dataframe columns
frame.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [100]:
# to see dataframe indexes
frame.index

Index(['1st', '2nd', '3rd', '4th', '5th', '6th'], dtype='object')

# To extract or access data from a dataframe
A column in  dataframe can be retrieved as a series either by dict-like notation or by attribute

In [101]:
print(data1)
# dictionary like notation means to access data from dictionary with key
print("\n\n", data1['state'])

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}


 ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

In [104]:
frame["year"]

1st    2000
2nd    2001
3rd    2002
4th    2001
5th    2002
6th    2003
Name: year, dtype: int64

In [107]:
# another method is attribute style of accessing dataframe data
frame.year

1st    2000
2nd    2001
3rd    2002
4th    2001
5th    2002
6th    2003
Name: year, dtype: int64

In [110]:
# accessing row from index label
frame.loc["3rd"]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 3rd, dtype: object

In [162]:
# when bringing data from dictionary, we can give additional column names
data1 = {
    'state' : ['Ohio','Ohio', 'Ohio','Nevada','Nevada','Nevada'],
    'year': [2000,2001,2002,2001,2002,2003],
    'pop': [1.5,1.7,3.6,2.4,2.9,3.2],
}

frame2 = pd.DataFrame(data1, columns = ['year', 'state', 'pop','debt'],
                     index = ['one','two','three','four','five',
                             'six'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [163]:
ln = len(frame2) # finding number of rows

# for column value equal to the number of rows of df
rng = np.arange(ln)

# giving the rng array in dept column
frame2['debt'] = rng
frame2

#inserting new values need to match the length of number of elements

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [166]:
# names of the index need to match to replace the values or dont provide index
val = pd.Series([-1.2,-1.5,-1.7,-1.2,-1.5,-1.7,2.2],
               index=['one','two','three','four','five','six','seven'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6  -1.7
four   2001  Nevada  2.4  -1.2
five   2002  Nevada  2.9  -1.5
six    2003  Nevada  3.2  -1.7

In [167]:
#column's value can be modified by assignment
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [168]:
# when bringing data from dictionary, we can give additional column names
data1 = {
    'state' : ['Ohio','Ohio', 'Ohio','Nevada','Nevada','Nevada'],
    'year': [2000,2001,2002,2001,2002,2003],
    'pop': [1.5,1.7,3.6,2.4,2.9,3.2],
}

frame2 = pd.DataFrame(data1, columns = ['year', 'state', 'pop','debt'],
                     index = ['one','two','three','four','five',
                             'six'])

print(len(frame2))
rng = np.arange(6.0)
print(rng)
frame2['debt'] = rng
frame2

6
[0. 1. 2. 3. 4. 5.]

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

# function application and maping

In [123]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.random.randn(4,3),
                    columns = list('bde'),
                    index = ['Utah','Ohio','Texas','Oregon'])
print(frame)
print('\n----------------------------------------\n')

# for positive values
print(np.abs(frame))

print('\n----------------------------------------\n')
# to get minimum value of d from frame
print(frame['d'].min())

# to get maximum value of d from frame
print(frame['d'].max())

print('\n----------------------------------------\n')
# to subtract max from min
print(frame['d'].max() - frame['d'].min())

               b         d         e
Utah    0.497109  0.563472  0.348257
Ohio    0.345198 -0.254010 -0.754775
Texas  -0.539820  1.240128  1.418442
Oregon  1.337855  0.856584  1.944554

----------------------------------------

               b         d         e
Utah    0.497109  0.563472  0.348257
Ohio    0.345198  0.254010  0.754775
Texas   0.539820  1.240128  1.418442
Oregon  1.337855  0.856584  1.944554

----------------------------------------

-0.25401023154582136
1.2401281557213186

----------------------------------------

1.49413838726714

In [125]:
#doing it with a function
f = lambda x: x.max() - x.min()
df = frame.apply(f)
print (df, type(df))

# used for column wise function or operations in a dataframe

b    1.877675
d    1.494138
e    2.699329
dtype: float64 <class 'pandas.core.series.Series'>

In [126]:
# to apply the function on rows
df = frame.apply(f, axis = 1)
print(df)

Utah      0.215215
Ohio      1.099972
Texas     1.958262
Oregon    1.087970
dtype: float64

In [131]:
#to do it with a prebuilt named function where x can be a column or row
def min_max(x):
    minimum = x.min()
    maximum = x.max()
    return pd.Series([maximum, minimum], index = ['min','max'])

#applying the function to the dataframe
df = frame.apply(min_max)
print(df,"\n",type(df))

# this also generates a dataframe

            b         d         e
min  1.337855  1.240128  1.944554
max -0.539820 -0.254010 -0.754775
 <class 'pandas.core.frame.DataFrame'>

In [133]:
def min_max(x):
    # function can also be given directly
    return pd.Series([x.min(), x.max()], index = ['min','max'])

#applying the function to the dataframe
df = frame.apply(min_max)
print(df,"\n",type(df))

            b         d         e
min -0.539820 -0.254010 -0.754775
max  1.337855  1.240128  1.944554
 <class 'pandas.core.frame.DataFrame'>

## Sorting and Ranking

In [139]:
frame2 = pd.DataFrame(np.arange(8).reshape(2,4),
                      index = ['three','one'], 
                      columns = ['d', 'a', 'b', 'c'])

print(frame2)
print()

# changes column order by sorting    
print(frame2.sort_index(axis = 1, ascending = False))
#                    column sort      reverse sort
print()

# sorts by row
# default in sort axis = 0, ascending = True
print(frame2.sort_index())

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

**to sort by values**

In [142]:
# to sort by column b
print(frame.sort_values(by = 'b'))
print()

# to rank from max to min,  row wise
print(frame.rank(ascending = False, method = 'max'))
print()

# to rank from min to max,  row wise
print(frame.rank(ascending = True, method = 'min'))
print()

# column wise ranking
print(frame.rank(axis = 'columns'))


#check other details from book

               b         d         e
Texas  -0.539820  1.240128  1.418442
Ohio    0.345198 -0.254010 -0.754775
Utah    0.497109  0.563472  0.348257
Oregon  1.337855  0.856584  1.944554

          b    d    e
Utah    2.0  3.0  3.0
Ohio    3.0  4.0  4.0
Texas   4.0  1.0  2.0
Oregon  1.0  2.0  1.0

          b    d    e
Utah    3.0  2.0  2.0
Ohio    2.0  1.0  1.0
Texas   1.0  4.0  3.0
Oregon  4.0  3.0  4.0

          b    d    e
Utah    2.0  3.0  1.0
Ohio    3.0  2.0  1.0
Texas   1.0  2.0  3.0
Oregon  2.0  1.0  3.0

## summing and computing descriptive stats

In [150]:
df = pd.DataFrame([
    [1.4, np.nan], [7.1, -4.5],
    [np.nan, np.nan], [0.75, -1.3]
    ], index = ['a', 'b', 'c', 'd'],
    columns = ['one', 'two']) 
    
print(df)
print()

# row wise sum
print(df.sum())
print()

#column wise sum
print(df.sum(axis = 'columns'))

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    9.25
two   -5.80
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [152]:
#mean
x = df.mean(axis = "columns", skipna = False)
# Nan values are not used in mean
print()
print(x)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [154]:
#to get unique values from df
df = pd.DataFrame([
    [1.4,1.4,1.5,np.nan], [7.1,-4.5,1.5,1.4],
    [1.4,np.nan,0.5,np.nan],[0.75,-1.3,1.3,np.nan]
], index = ['a', 'b','c','d'], columns=['one','two','three','four'])

print(df['one'].unique(), df['two'].unique())

#tells how many times a certain value has encountered
df['one'].value_counts()

[1.4  7.1  0.75] [ 1.4 -4.5  nan -1.3]

1.40    2
0.75    1
7.10    1
Name: one, dtype: int64

# loc and iloc data selection

In [40]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['Ohio','Colorado','Utah','New York'],
                      columns= ['one','two','three','four'])

#print(data_df, "\n")
#df2 = data_df[['one','three']]
#print(df2)
#print(data_df[2:])             #filter same like numpy on entire dataframe
#print(data_df['one'])          # gives data of that column (dictionary style)
print(data_df.one, "\n")          # attribute style 
print(data_df.one[2:])              # combine filter


#conditional selection filter
print('\n\n',data_df[data_df['three'] > 5])
#print(data_df, '\n')

df2 = data_df['three'] > 5      # boolean dataframe
print('\n',df2)

# for selection within filter to show data
print(data_df[df2] )

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

Utah         8
New York    12
Name: one, dtype: int32


           one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

 Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool
          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [45]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['Ohio','Colorado','Utah','New York'],
                      columns= ['one','two','three','four'])

# in the loc method specify row label
# then, 
# specify column names
# remember!, multiple column names require array notation
print(data_df.loc['Colorado', ['two', 'three']])

# for multiple rows
print("\n",data_df.loc[['Colorado', 'Ohio'], ['two', 'three']])

two      5
three    6
Name: Colorado, dtype: int32

           two  three
Colorado    5      6
Ohio        1      2

In [47]:
# we can numbers instead of labels for iloc
print(data_df, "\n")

print(data_df.iloc[2,[3,0,1]])          # by fancy indexing

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

four    11
one      8
two      9
Name: Utah, dtype: int32

In [48]:
# to see full dataframe
print(data_df.iloc[:])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
#for multidimensional
print(data_df.iloc[ :3 , :3])
#             three rows ,three columns

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10

In [52]:
#giving only rows without column information
print(data_df.iloc[:2])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

# Arithmatic and Data Allignment

In [61]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                   columns = list('bcd'),
                   index = ['Ohio','Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                   columns = list('bde'),
                   index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1)
print('\n',df2)
print()

#applying plus operation
df3 = df1 + df2
# it tries to match the indexes than adds the values


print(df3)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

           b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

# Arithmatic methods with fill values

In [179]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns=list('abcde'))

print(df1)
print()
df2.loc[1,'b'] = np.nan
print(df2)
df3 = df1 + df2
print("--------------------------------------------")
print("direct + operation without fill_value")
print(df3)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0
--------------------------------------------
direct + operation without fill_value
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [180]:
# we can use add method for filling NaN cells with a value
# NaN will be replaced by 0 ad then addition will apply
print("addition using a method with replacing NaN with 0")
df3 = df1.add(df2, fill_value = 0)
print(df3)

addition using a method with replacing NaN with 0
      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

# operations between dataframe and series

In [3]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                     columns = list('bde'),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

#iloc syntax
#iloc[start_row_pos:end_row_pos, start_column_pos: end_col_position]
series = frame.iloc[0]
print(frame)
#print(series)
#print(series.values)
#print(series.index)
#print(frame - series)
#step 1: run above commands
#step 2: comment above prints except the line containing print(frame)
#write following lines and run cell again
print("---------------using new series")
series = pd.Series([1,2,3], index = list('bde'))
print(series.index, series.values)
print(frame - series)
#dataframe column names will be match with series index
# because its *row wise* broadcasting operation


# series are minused one by one from each column

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
---------------using new series
Index(['b', 'd', 'e'], dtype='object') [1 2 3]
          b    d    e
Utah   -1.0 -1.0 -1.0
Ohio    2.0  2.0  2.0
Texas   5.0  5.0  5.0
Oregon  8.0  8.0  8.0

# Reindex
it is a method of dataframe and has parameter named reindex
method takes a parameter ffill, it reuses previous value for NaN values (fill forward)

In [23]:
import pandas as pd
obj3 = pd.Series(['blue','purple','yellow'], index = [0,3,6])
print(obj3)

# range method from python
# reindex might create new rows and new indexes
# ffill fills the NaN values
obj3 = obj3.reindex(range(9), method = 'ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [25]:
obj3 = obj3.reindex(range(14))
obj3

0       blue
1       blue
2       blue
3     purple
4     purple
5     purple
6     yellow
7     yellow
8     yellow
9        NaN
10       NaN
11       NaN
12       NaN
13       NaN
dtype: object

In [11]:
import numpy as np
import pandas as pd
states = pd.DataFrame(np.arange(9).reshape((3,3)),
index = ['a','c','d'], columns = ['Ohio','Texas','California'])

print(states, "\n")
states = states.reindex(['a','b','c','d'],method = 'ffill')
print(states, "\n")
states = states.reindex(['a','b','c','d','e'])
print(states, "\n")

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

   Ohio  Texas  California
a   0.0    1.0         2.0
b   0.0    1.0         2.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [14]:
#column name changing using reindex method
states = pd.DataFrame(np.arange(9).reshape((3,3)),
index = ['a','c','d'], columns = ['Ohio','Texas','California'])

print(states)
states_name = ['Texas','Utah','California','Ohio']

#column wise change
states = states.reindex(columns = states_name)
print(states)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
   Texas  Utah  California  Ohio
a      1   NaN           2     0
c      4   NaN           5     3
d      7   NaN           8     6

# deleting data

In [72]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['Ohio','Colorado', 'Utah', 'New York'], 
                      columns = ['one','two','three','four'])

print(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['Ohio','Colorado', 'Utah', 'New York'], 
                      columns = ['one','two','three','four'])

print(data_df, "\n")

#dataframe.drop method would return a new dataframe without having
# deleted rows, so store it into dataframe variable or use
# inplace = True while droping rows of columns

data_df.drop(['Colorado', 'Ohio'], inplace = True)
print(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
# you can drop values from the columns by passing axis = 1
#or axis = 'columns'
data_df = data_df.drop( 'two', axis = 1)
print(data_df)

# rows = axis 0
# columns = axis 1

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [74]:
# to remove a row
data_df = data_df.drop( 'Colorado')
print(data_df)

          one  three  four
Ohio        0      2     3
Utah        8     10    11
New York   12     14    15

# indexing selection and filtering

In [79]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['Ohio','Colorado', 'Utah', 'New York'], 
                      columns = ['one','two','three','four'])

#print(data_df, "\n")

#printing two rows only
df2 = data_df[['one', 'three']]
print(df2)

#df2 = data_df.Ohio["2"]


#Condtional Selection
#print(data_df[data_df['three'] > 5])

#print(data_df, "\n")

#df2 = data_df['three'] > 5
#print(df2)
#print(data_df [data_df['three'] > 5])

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [80]:
# printing in numpy style
print(data_df[2:])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15